Tekla Open API Reference for Tekla Structures 2025
DrawingItem Class
 The DrawingItem class contains information from the drawings in the master drawing catalog.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.DrawingItem
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class DrawingItem
<SerializableAttribute>
Public NotInheritable Class DrawingItem
The DrawingItem type exposes the following members.
Constructors
Name | Description
DrawingItem
 Creates a new drawing item instance.
Top
Properties
Name | Description
Files
 The files belonging to drawing item.
Name
 The drawing item's name.
Type
 The files belonging to drawing item.
Top
Methods
Name | Description
Export
 Exports the drawing item in the catalog to given file name. If path is not given drawing is exported to model folder. If filename is empty drawing name is used as filename.
Select
 Selects the drawing item in the drawing catalog.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace